{
	"home_description": "Hello there, and welcome to my portfolio.\nHere you will see my prior achievements and previous projects I have worked on.\nMany of these I'm personally proud of and would happily do again and/or expand upon with some of my own ideas to truly make it my own if I was ever given the chance to (and since many have their own GitHub repositories, I can!).\nThis serves as a continual living documentary of my growth as a developer and of all the projects under my belt (some of which aren't easy to deploy and keep up on the Web for one reason or another).\nThis website is also fully translatable using i18n components under Astro, such as <a class='hover:underline' target='_blank' rel='noopener noreferrer' href='https://www.npmjs.com/package/i18n-auto-translation'>i18n-auto-translation</a> and the like.\n\nIf you have any questions, please feel free to contact me using any of the social media icons below.\n\nA copy of my most current resumé can be downloaded below.",
	"home_resume": "Download Resumé",
	"project1_description": "This very portfolio website is a demonstration of how quickly I can learn and put together websites in new technologies. It also is a good test of how fast and optimized I can make my webpages. This project uses Astro, Tailwind CSS, and Alpine.js. It also has full marks and the full PWA badge on Google Lighthouse as of 11.5.0. It's good to see you here!",
	"project1_template": "To see the starter template this website is based off of:",
	"project2_description": "This photo album was a project for a programming course I am currently in. This project uses React, Next.js, Tailwind CSS, and uses a NoSQL database powered by MongoDB with a variant using a MySQL database and PHP also being available. It also has full marks on Google Lighthouse and the full PWA badge as of Lighthouse 11.5.0.",
	"project2_mongodb_nextjs": "To see the MongoDB/NextJS version of this project:",
	"project2_mysql_php": "To see the MySQL/PHP version of this project:",
	"about_description": "Hello, I'm Colton Rushton, a junior web developer-in-training with some experience in various frameworks and programming languages under my belt. Experienced in JavaScript, TypeScript, React, Next.js, CSS, HTML, Tailwind, Bootstrap, PHP, and WordPress, and having dabbled in many others, I'm ready to take on any challenge that's given to me.\n\nThis portfolio website being an example of that, as it is in Astro which is not something I normally develop in.\nThis website was initially developed in four days to production quality, and it legitimately looks like something that normally would take weeks to build in any other programming language or framework.\nIt is this type of quality I strive to bring to the table every day when I come to work. I'll do whatever I can to ensure that any website I'm a part of is done to spec and has as high of a Google Lighthouse and PWA score as possible.\n\nThis website has 100% in every category in every page (unless Vercel decides it wants to be slow, beyond my control) as well as the full PWA certification badge in production mode, tested and proven throughout the process."
}
