{
  "home_description": "Bonjour et bienvenue dans mon portfolio.\nVous y verrez mes réalisations antérieures et les projets sur lesquels j'ai travaillé.\nJe suis personnellement fier de beaucoup d'entre eux et je serais heureux de les refaire et/ou de les développer avec mes propres idées pour les rendre vraiment personnels si on m'en donnait la chance (et comme beaucoup ont leur propre dépôt GitHub, je peux !).\nCeci sert de documentaire vivant et continu de ma croissance en tant que développeur et de tous les projets à ma disposition (dont certains ne sont pas faciles à déployer et à maintenir sur le Web pour une raison ou une autre).\nCe site est également entièrement traduisible en utilisant les composants i18n sous Astro, tels que <a class='hover:underline' target='_blank' rel='noopener noreferrer' href='https://www.npmjs.com/package/i18n-auto-translation'>i18n-auto-translation</a> et autres.\n\nSi vous avez des questions, n'hésitez pas à me contacter en utilisant l'une des icônes de médias sociaux ci-dessous.\n\nUne copie de mon CV le plus récent peut être téléchargée ci-dessous.",
  "home_resume": "Télécharger le CV",
  "project1_description": "Ce site web très portfolio est une démonstration de la rapidité avec laquelle je peux apprendre et mettre en place des sites web dans de nouvelles technologies. C'est aussi un bon test de la rapidité et de l'optimisation de mes pages web. Ce projet utilise Astro, Tailwind CSS, et Alpine.js. Il a également toutes les notes et le badge PWA sur Google Lighthouse à partir de la version 11.5.0. C'est bon de vous voir ici !",
  "project1_template": "Pour voir le modèle de départ sur lequel ce site est basé :",
  "project2_description": "Cet album photo était un projet pour un cours de programmation que je suis actuellement. Ce projet utilise React, Next.js, Tailwind CSS, et utilise une base de données NoSQL alimentée par MongoDB avec une variante utilisant une base de données MySQL et PHP également disponible. Il a également des notes complètes sur Google Lighthouse et le badge PWA complet à partir de Lighthouse 11.5.0.",
  "project2_mongodb_nextjs": "Pour voir la version MongoDB/NextJS de ce projet :",
  "project2_mysql_php": "Pour voir la version MySQL/PHP de ce projet :",
  "about_description": "Bonjour, je suis Colton Rushton, un développeur web junior en formation avec une certaine expérience dans divers cadres et langages de programmation à mon actif. Expérimenté en JavaScript, TypeScript, React, Next.js, CSS, HTML, Tailwind, Bootstrap, PHP, et WordPress, et ayant tâté de beaucoup d'autres, je suis prêt à relever n'importe quel défi qui me sera proposé.\n\nCe site web en est un exemple, puisqu'il est en Astro, un langage que je n'utilise pas habituellement.\nCe site a été développé en quatre jours pour atteindre la qualité de production, et il ressemble légitimement à quelque chose qui prendrait des semaines à construire dans n'importe quel autre langage de programmation ou framework.\nC'est ce type de qualité que je m'efforce d'apporter chaque jour au travail. Je ferai tout ce qui est en mon pouvoir pour m'assurer que tout site web dont je fais partie est réalisé selon les spécifications et a un score Google Lighthouse et PWA aussi élevé que possible.\n\nCe site a 100% dans chaque catégorie sur chaque page (à moins que Vercel ne décide d'être lent, ce qui est indépendant de ma volonté) ainsi que le badge de certification PWA complet en mode production, testé et prouvé tout au long du processus."
}
